[
  {
    "Tipo de Tarefa": 1,
    "Perfil do Usuário": 1,
    "Ambiente": 1,
    "Fase do SDLC": 3,
    "Objetivo da Avaliação": 4,
    "Recursos Disponíveis": 2,
    "Método(s) Recomendado(s)": "A + C + D",
    "Justificativa": "Evidência baseada em n=2 estudos. Neste contexto de teste com usuários leigos em laboratório, a combinação A+C+D foi unânime (100%). O método Qualitativo (A - e.g., 'think aloud') é essencial para entender as dificuldades do usuário. O método Quantitativo (C - e.g., 'eye tracking', tempo de tarefa) mede objetivamente o desempenho. O método de Auto-relato (D - e.g., questionários) captura a satisfação. Juntos, oferecem uma visão 360 graus da usabilidade.",
    "Métodos Representativos (da amostra)": [
      "Testes práticos com tarefas, protocolo think-aloud, gravações com Morae, questionário online",
      "testes práticos de tarefas, eye-tracking, questionário SUS, e protocolo think aloud"
    ]
  },
  {
    "Tipo de Tarefa": 1,
    "Perfil do Usuário": 2,
    "Ambiente": 2,
    "Fase do SDLC": 3,
    "Objetivo da Avaliação": 1,
    "Recursos Disponíveis": 1,
    "Método(s) Recomendado(s)": "B",
    "Justificativa": "Evidência baseada em n=1 estudo. Para identificar problemas de usabilidade com usuários especialistas em um ambiente controlado e com poucos recursos, um estudo de usuário focado (Método Observacional - B) demonstrou ser uma abordagem direta e eficaz, permitindo observações focadas no comportamento do especialista ao realizar tarefas.",
    "Métodos Representativos (da amostra)": [
      "\"estudo de usuário primário\" para demonstrar a usabilidade do software"
    ]
  },
  {
    "Tipo de Tarefa": 1,
    "Perfil do Usuário": 2,
    "Ambiente": 3,
    "Fase do SDLC": 4,
    "Objetivo da Avaliação": 4,
    "Recursos Disponíveis": 1,
    "Método(s) Recomendado(s)": "D",
    "Justificativa": "Evidência baseada em n=5 estudos. Para medir desempenho e satisfação de usuários especialistas de forma remota e com poucos recursos, o uso de Métodos de Inspeção e Auto-relato (D) é predominante (100% dos casos). Questionários padronizados como o SUS são escaláveis, de baixo custo e eficazes para coletar dados de um grande número de usuários em sistemas já em operação.",
    "Métodos Representativos (da amostra)": [
      "O estudo avaliou a usabilidade da plataforma CrimeTelescope por meio de uma pesquisa SUS (System Usability Scale).",
      "Registro automatizado de interações + mineração de padrões + questionário pós-uso",
      "abordagem exploratória, o método de inspeção e a System Usability Scale (SUS)",
      "questionários quantitativos + feedback textual + desempenho em tarefas práticas",
      "Aplicação de teste empírico por meio de questionário online com tarefas de contagem visual."
    ]
  },
  {
    "Tipo de Tarefa": 1,
    "Perfil do Usuário": 3,
    "Ambiente": 2,
    "Fase do SDLC": 1,
    "Objetivo da Avaliação": 4,
    "Recursos Disponíveis": 1,
    "Método(s) Recomendado(s)": "A + D",
    "Justificativa": "Evidência baseada em n=2 estudos. Na fase de requisitos com um público misto e poucos recursos, a combinação A+D foi a escolha em 100% dos casos. O método Qualitativo (A - e.g., entrevistas, feedback) é fundamental para levantar requisitos e entender as necessidades. O método de Auto-relato (D - e.g., formulários) ajuda a quantificar e priorizar as percepções iniciais dos usuários de forma estruturada.",
    "Métodos Representativos (da amostra)": [
      "Foram colhidas respostas qualitativas (opiniões dos usuários) e quantitativas (número de respostas positivas/negativas).",
      "Formulário; Feedback"
    ]
  },
  {
    "Tipo de Tarefa": 2,
    "Perfil do Usuário": 1,
    "Ambiente": 2,
    "Fase do SDLC": 4,
    "Objetivo da Avaliação": 4,
    "Recursos Disponíveis": 1,
    "Método(s) Recomendado(s)": "B",
    "Justificativa": "Evidência baseada em n=1 estudo. Para avaliar um sistema em produção (focado em síntese/planejamento) com usuários leigos e poucos recursos, uma abordagem Observacional (B) baseada em um estudo de usuário final e análise de conformidade por especialistas (QIT) foi utilizada. Este método permite focar na interação real para ranquear preferências.",
    "Métodos Representativos (da amostra)": [
      "Avaliação por especialistas e usuários finais em duas fases: análise de conformidade com parâmetros de qualidade (QIT) e posterior ranqueamento com base nas preferências do usuário."
    ]
  },
  {
    "Tipo de Tarefa": 3,
    "Perfil do Usuário": 1,
    "Ambiente": 3,
    "Fase do SDLC": 3,
    "Objetivo da Avaliação": 3,
    "Recursos Disponíveis": 1,
    "Método(s) Recomendado(s)": "D",
    "Justificativa": "Evidência baseada em n=1 estudo. Para avaliar a conformidade de uma ferramenta de edição de dados com usuários leigos de forma remota e com poucos recursos, o uso exclusivo de Métodos de Inspeção (D) foi a abordagem escolhida. A avaliação heurística por especialistas (SIRIUS) combinada com ferramentas automáticas de acessibilidade é uma forma eficiente e de baixo custo para verificar a conformidade com padrões estabelecidos.",
    "Métodos Representativos (da amostra)": [
      "Avaliação heurística por especialistas (SIRIUS) + ferramentas automáticas de acessibilidade (TAW, eXaminator, UTP)"
    ]
  },
  {
    "Tipo de Tarefa": 3,
    "Perfil do Usuário": 2,
    "Ambiente": 4,
    "Fase do SDLC": 3,
    "Objetivo da Avaliação": 3,
    "Recursos Disponíveis": 3,
    "Método(s) Recomendado(s)": "B + D",
    "Justificativa": "Evidência baseada em n=1 estudo. Para avaliar a conformidade no contexto real de uso por especialistas com altos recursos, a combinação B+D foi utilizada. O método Observacional (B) permite verificar a aplicação prática em workshops, enquanto o método de Auto-relato (D - questionários) coleta feedback estruturado, e a análise das interações oferece dados complementares.",
    "Métodos Representativos (da amostra)": [
      "Testes de usabilidade baseados em observação direta, coleta de feedback dos usuários durante workshops, e aplicação de questionários."
    ]
  },
  {
    "Tipo de Tarefa": 4,
    "Perfil do Usuário": 1,
    "Ambiente": 3,
    "Fase do SDLC": 2,
    "Objetivo da Avaliação": 1,
    "Recursos Disponíveis": 2,
    "Método(s) Recomendado(s)": "B + D",
    "Justificativa": "Evidência baseada em n=1 estudo. Na fase de design de um sistema de navegação para usuários leigos, a combinação B+D foi empregada. A Observação (B) da criação de modelos pelos usuários e a análise das suas interações fornecem insights sobre o processo de uso, enquanto o questionário SUS (D) oferece uma medida padronizada da percepção de usabilidade do protótipo.",
    "Métodos Representativos (da amostra)": [
      "System Usability Scale (SUS) + observação da criação de modelos pelos usuários"
    ]
  },
  {
    "Tipo de Tarefa": 4,
    "Perfil do Usuário": 2,
    "Ambiente": 1,
    "Fase do SDLC": 3,
    "Objetivo da Avaliação": 4,
    "Recursos Disponíveis": 2,
    "Método(s) Recomendado(s)": "A + C + D",
    "Justificativa": "Evidência baseada em n=1 estudo. Para medir de forma completa a usabilidade de um sistema de navegação com usuários especialistas em laboratório, a triangulação de métodos A+C+D é robusta. Coletam-se métricas de desempenho (C - precisão, tempo), a percepção de satisfação (D - survey) e o raciocínio do usuário (A - entrevista), provendo uma avaliação compreensiva.",
    "Métodos Representativos (da amostra)": [
      "Survey com escala Likert, entrevista, análise de densidade de kernel dos pontos marcados, e classificação pós-processada de objetos georreferenciados"
    ]
  },
  {
    "Tipo de Tarefa": 5,
    "Perfil do Usuário": 2,
    "Ambiente": 2,
    "Fase do SDLC": 4,
    "Objetivo da Avaliação": 4,
    "Recursos Disponíveis": 2,
    "Método(s) Recomendado(s)": "C + D",
    "Justificativa": "Evidência baseada em n=2 estudos. Para medir o desempenho e a satisfação de sistemas diversos com usuários especialistas em ambientes controlados, a combinação C+D foi unânime (100%). A medição do desempenho em tarefas (C) avalia a eficácia do sistema, enquanto os questionários (D - e.g., Likert) e grupos focais medem a percepção e a satisfação do usuário, sendo uma abordagem mista e eficaz.",
    "Métodos Representativos (da amostra)": [
      "Survey com escala de Likert, análise de uso (tempo e número de marcadores), grupo focal",
      "Avaliação qualitativa baseada em feedback de usuários e análise de desempenho visual em tarefas de seleção temporal."
    ]
  }
]
